from pandas import DataFrame
print('----'*30)
print('Табель учащихся в средней школе # 1285')

stud_card = {
        'ID': ['01','02','03','04','05','06','07','08','09','10'],
        'Имя' : ['Иван','Артемий','Екатерина','Ольга','Дмитрий','Александр','Алексей','Максим','Анна','Клим'],
        'Фамилия': ['Кудряшов','Бойко','Желудкова','Маштакова','Федотов','Ошовский','Горинов','Буянов','Травкина','Некрасов'],
        'Дата рождения' : ['17.08.2000','04.05.2001','01.04.2001','23.02.2002','08.03.2004','19.08.2003','11.01.2001','27.12.2002','15.02.2002','03.05.2001'],
        'Успеваемость' : ['Отличник','Троечник','Хорошист','Отличник','Хорошист','Отличник','Двоечник','Хорошист','Троечник','Отличник']
}
    
sc = DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)